In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'/Users/alliequalman/downloads'

In [3]:
df_customers = pd.read_csv(os.path.join(path, r'/Users/alliequalman/Downloads/customers.csv'))

In [4]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_customers['user_id'].value_counts(dropna = False)

26711     1
67322     1
173044    1
61044     1
98344     1
         ..
146847    1
154991    1
172193    1
184326    1
80148     1
Name: user_id, Length: 206209, dtype: int64

In [6]:
df_customers['First Name'].value_counts(dropna = False)

NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: First Name, Length: 208, dtype: int64

In [7]:
df_customers['Surnam'].value_counts(dropna = False)

Hamilton      252
Randall       248
Lamb          243
Pennington    243
Barnett       242
             ...
Poole         172
Bauer         166
Pearson       164
Payne         163
Jordan        162
Name: Surnam, Length: 1000, dtype: int64

In [8]:
df_customers['Gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: Gender, dtype: int64

In [9]:
df_customers['Age'].value_counts(dropna = False)

19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: Age, Length: 64, dtype: int64

In [10]:
df_customers['date_joined'].value_counts(dropna = False)

9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: date_joined, Length: 1187, dtype: int64

In [11]:
df_customers['n_dependants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

In [12]:
df_customers['fam_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [13]:
df_customers['income'].value_counts(dropna = False)

57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: income, Length: 108012, dtype: int64

In [14]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
df_customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [16]:
df_customers.rename(columns = {'Surnam' : 'last_name'}, inplace = True)

In [17]:
df_customers.rename(columns = {'income' : 'income'}, inplace = True)

In [18]:
df_customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [19]:
df_customers.rename(columns = {'n_dependants' : 'number_of_dependents'}, inplace = True)

In [20]:
df_customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [21]:
df_customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [22]:
df_customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [23]:
df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [24]:
df_customers.describe()

             user_id            age  number_of_dependents         income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [25]:
df_customers.isnull().sum()

user_id                     0
first_name              11259
last_name                   0
gender                      0
state                       0
age                         0
date_joined                 0
number_of_dependents        0
marital_status              0
income                      0
dtype: int64

In [26]:
#dropping NaN values
df_customers.dropna(inplace = True)

In [27]:
df_customers.shape

(194950, 10)

In [28]:
#checking for duplicated rows
df_dups = df_customers[df_customers.duplicated()]

In [29]:
#no dups
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, number_of_dependents, marital_status, income]
Index: []

In [30]:
df_customers.shape

(194950, 10)

In [31]:
# Changing user_id from int to str - statistics won't need to be calculated for this column
df_customers['user_id'] = df_customers['user_id'].astype('str')

In [32]:
df_customers['user_id'].dtype

dtype('O')

In [33]:
df_customers.dtypes

user_id                 object
first_name              object
last_name               object
gender                  object
state                   object
age                      int64
date_joined             object
number_of_dependents     int64
marital_status          object
income                   int64
dtype: object

In [34]:
df_customers.describe()

                 age  number_of_dependents         income
count  194950.000000         194950.000000  194950.000000
mean       49.511167              1.499600   94664.811495
std        18.476519              1.117959   42477.262653
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59924.000000
50%        49.000000              1.000000   93572.500000
75%        66.000000              2.000000  124261.000000
max        81.000000              3.000000  593901.000000

In [35]:
# Checking for columns with mixed data types

for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

In [36]:
# Exporting file as pickle

df_customers.to_pickle(os.path.join(path, r'/Users/alliequalman/Documents/Instacart Basket Analysis /Scripts/Scripts/df_customers_wrangled.pkl'))

In [37]:
# Importing updated customers dataframe

df_custsomers = pd.read_pickle(os.path.join(path, r'/Users/alliequalman/Documents/Instacart Basket Analysis /Scripts/Scripts/df_customers_wrangled.pkl'))

In [38]:
# Double checking shape of df_customer

df_customers.shape

(194950, 10)

In [39]:
# Double checking headers of df_custs

df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependents,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [40]:
#importing orders products merge

ords_prods_merge = pd.read_pickle(os.path.join(path, r'/Users/alliequalman/Documents/Instacart Basket Analysis /Scripts/Scripts/ Import_to_4.8_.pkl'))

In [41]:
ords_prods_merge.shape

(32404859, 22)

In [42]:
# Double checking headers of ords_prods_merged

ords_prods_merge.head()

,order_id,user_id,eval_set,order_number,order_days_of_week,hour_order_placed,days_since_prior_order,product_id,add_to_cart_order,reordered,...,aisle_id,department_id,prices,_merge,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,77,7,9.0,both,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,77,7,9.0,both,Mid-range product,Regularly busy,Slowest days,Average orders,10,New customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,77,7,9.0,both,Mid-range product,Regularly busy,Slowest days,Most orders,10,New customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,77,7,9.0,both,Mid-range product,Least busy,Slowest days,Average orders,10,New customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,77,7,9.0,both,Mid-range product,Least busy,Slowest days,Most orders,10,New customer

In [43]:
# Checking data type of ords_prods_merged 'user_id'

ords_prods_merge['user_id'].dtype

dtype('int64')

In [44]:
# Converting ords_prods_merge 'user_id' to str - this way 'user_id' from both data sets are the same data type

ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [45]:
# Merging data sets

ords_prods_cust_merged = ords_prods_merge.merge(df_customers, on = 'user_id')

In [46]:
# Double checking merged shape

ords_prods_cust_merged.shape

(30629741, 31)

In [47]:
# Checking all columns

pd.options.display.max_columns = None
ords_prods_cust_merged.head()

,order_id,user_id,eval_set,order_number,order_days_of_week,hour_order_placed,days_since_prior_order,product_id,add_to_cart_order,reordered,Unnamed: 0,product_name,aisle_id,department_id,prices,_merge,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,first_name,last_name,gender,state,age,date_joined,number_of_dependents,marital_status,income
0,2539329,1,prior,1,2,8,NaN,196,1,0,195,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Regularly busy,Average orders,10,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,prior,2,3,7,15.0,196,1,1,195,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Slowest days,Average orders,10,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,prior,3,3,12,21.0,196,1,1,195,Soda,77,7,9.0,both,Mid-range product,Regularly busy,Slowest days,Most orders,10,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,prior,4,4,7,29.0,196,1,1,195,Soda,77,7,9.0,both,Mid-range product,Least busy,Slowest days,Average orders,10,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,prior,5,4,15,28.0,196,1,1,195,Soda,77,7,9.0,both,Mid-range product,Least busy,Slowest days,Most orders,10,New customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [48]:
# Export ords_prods_cust_merged as pickle file

ords_prods_cust_merged.to_pickle(os.path.join(path, r'/Users/alliequalman/Documents/Instacart Basket Analysis /Scripts/Scripts/4.9_part_1.pkl'))